AlmAck/nuttx/arch/arm/src/da1470x/da1470x_cmac.c
/****************************************************************************
 * arch/arm/src/da1470x/da1470x_cmac.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* The DA1470x BLE controller runs on a separate Cortex-M0+ (the CMAC) from
 * a firmware image the host copies into RAM10.  Host and controller talk
 * through two 504-byte rings in the controller's data area, each with a
 * small header {magic, flags, write index, read index}, and signal each
 * other with the SYS2CMAC / CMAC2SYS interrupt bits.
 *
 * The boot handshake, the ring protocol and the fixed table addresses
 * below were recovered from the SDK's cmac_cpu_lld / cmac_mailbox objects
 * and belong to the firmware image "CMAC v1.0.0" of SDK 10.2.6.49.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include "arm_internal.h"
#include "nvic.h"
#include "hardware/da1470x_crg_top.h"
#include "hardware/da1470x_crg_xtal.h"
#include "hardware/da1470x_memctrl.h"
#include "hardware/da1470x_memorymap.h"
#include "da1470x_clockconfig.h"
#include "da1470x_cmac.h"
#include "da1470x_pdc.h"
#include "da1470x_tcs.h"
#include "da1470x_pmu.h"

#ifdef CONFIG_DA1470X_BLE

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Firmware area header (36 bytes) followed by the image */

#define CMAC_FW_HDR_SIZE          0x24
#define CMAC_FW_HDR_MAGIC         0x11223344
#define CMAC_FW_HDR_IMGSIZE_OFF   4
#define CMAC_FW_HDR_MAGIC_OFF     8

/* Where the image goes and the fixed tables inside it (firmware 1.0.0) */

#define CMAC_CODE_BASE            DA1470X_SRAM10_BASE     /* 0x20150000 */

/* Offset of the controller data window, written to CMI_DATA_BASE_REG
 * before the controller is released.  The whole of RAM10 is left as its
 * code region, so the window starts at zero.
 */

#define CMAC_DATA_WINDOW_BASE     0
#define CMAC_AREA_SIZE            0x23024
#define CMAC_CONFIG_TABLE         0x2016a0d8
#define CMAC_DYNAMIC_TABLE        0x20172bb4
#define CMAC_INFO_TABLE           0x20172b6c
#define CMAC_TCS_TABLE            0x20171d74
#define CMAC_SYS_TCS_TABLE        0x20171d84
#define CMAC_EXCEPTION_CTX        0x20171dc4

/* Host-side tables the controller dereferences.  They must sit inside the
 * controller's data window (above RAM8), so they are placed in RAM10
 * right after the firmware area, which the linker reserves.
 */

#define CMAC_HOST_TCS_ATTR        0x20174000   /* uint16_t[0xe0], 448 B */
#define CMAC_HOST_TCS_DATA        0x20174200   /* uint32_t[512], 2 KiB */
#define CMAC_HOST_TCS_DATA_MAX    512
#define CMAC_HOST_TEMPSENS        0x20174a00   /* uint32_t */

/* Mailbox blocks: {u16 magic; u16 flags; u16 wr; u16 rd; u8 buf[504]} */

#define CMAC_MBOX_SYS2CMAC        0x2017296c   /* Host writes */
#define CMAC_MBOX_CMAC2SYS        0x2017276c   /* Host reads */
#define CMAC_MBOX_BUFSIZE         504
#define CMAC_MBOX_MAGIC           0xa55a

#define CMAC_MBOX_FLAG_HCI        0x01
#define CMAC_MBOX_FLAG_ERROR      0x02
#define CMAC_MBOX_FLAG_FLOW       0x04
#define CMAC_MBOX_FLAG_RESET      0x08
#define CMAC_MBOX_FLAG_WRITE_PEND 0x10

/* CMAC status word visible to the host; bits 7-9 flag a controller fault */

#define CMAC_STATUS_REG           (DA1470X_CMAC_BASE + 0x2000)
#define CMAC_STATUS_ERROR_MASK    0x380
#define CMAC_STATUS_READY         (1u << 31)

/* Bounded waits */

#define CMAC_WAIT_LOOPS           4000000

/* Configuration table field offsets (cmac_configuration_table_t) */

#define CFG_WAIT_ON_MAIN          0
#define CFG_BD_ADDRESS            1
#define CFG_RF_CAL_DELAY          7
#define CFG_LP_CLOCK_FREQ         8
#define CFG_LP_CLOCK_DRIFT        10
#define CFG_RX_BUFFER_SIZE        12
#define CFG_TX_BUFFER_SIZE        14
#define CFG_LENGTH_EXCHANGE       16
#define CFG_SYSTEM_TCS_LENGTH     26
#define CFG_SYNTH_TCS_LENGTH      27
#define CFG_RFCU_TCS_LENGTH       28
#define CFG_INITIAL_TX_POWER      29
#define CFG_DUP_FILTER_MAX        30

/* Dynamic table offsets (cmac_dynamic_configuration_table_t) */

#define DYN_SLEEP_ENABLE          0
#define DYN_POWER_CTRL_WAKEUP     0x20
#define DYN_POWER_CTRL_SLEEP      0x24
#define DYN_POWER_LVL_WAKEUP      0x28
#define DYN_POWER_LVL_SLEEP       0x2c
#define DYN_TEMPSENS_PTR          0x30
#define DYN_MACCPU_STATE          0x34

/* TCS table (cmac_tcs_table_t) */

#define TCS_ATTR_PTR              0
#define TCS_ATTR_SIZE             4
#define TCS_DATA_PTR              8
#define TCS_DATA_SIZE             12

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct cmac_mbox_s
{
  volatile uint16_t magic;
  volatile uint16_t flags;
  volatile uint16_t wr;
  volatile uint16_t rd;
  volatile uint8_t  buf[CMAC_MBOX_BUFSIZE];
};

