AlmAck/nuttx/arch/arm/src/da1470x/da1470x_cmac.c
struct da1470x_cmac_s
{
  struct cmac_mbox_s *tx;       /* Host -> controller ring */
  struct cmac_mbox_s *rx;       /* Controller -> host ring */
  uint16_t last_rd;             /* Last known controller read index */
  int pdc_entry;                /* SYS2CMAC wake-up entry */
  bool running;

  /* Deferred part of a write that did not fit */

  const uint8_t *pend_buf;
  size_t pend_len;

  da1470x_cmac_rx_t rx_cb;
  void *rx_arg;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct da1470x_cmac_s g_cmac =
{
  .tx        = (struct cmac_mbox_s *)CMAC_MBOX_SYS2CMAC,
  .rx        = (struct cmac_mbox_s *)CMAC_MBOX_CMAC2SYS,
  .pdc_entry = DA1470X_PDC_INVALID_ENTRY,
};

/* Firmware image provided by the board (see da1470x_cmac_fw.S) */

extern const uint8_t g_da1470x_cmac_fw[];
extern const uint8_t g_da1470x_cmac_fw_end[];

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: cmac_signal
 *
 * Description:
 *   Raise the SYS2CMAC interrupt.
 *
 ****************************************************************************/

static inline void cmac_signal(void)
{
  modifyreg32(DA1470X_CRG_XTAL_SET_SYS_IRQ_CTRL, 0,
              CRG_XTAL_SYS_IRQ_CTRL_SYS2CMAC_IRQ_BIT);
}

/****************************************************************************
 * Name: cmac_wait_bits
 ****************************************************************************/

static int cmac_wait_bits(uintptr_t addr, uint32_t mask, bool set)
{
  int i;

  for (i = 0; i < CMAC_WAIT_LOOPS; i++)
    {
      uint32_t v = getreg32(addr) & mask;

      if ((set && v != 0) || (!set && v == 0))
        {
          return OK;
        }
    }

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: cmac_m33_to_cmac_addr
 *
 * Description:
 *   Translate a SYSRAM address into the controller's view, as the SDK's
 *   m33_to_cmac_addr() does, using the data window base programmed by
 *   the controller itself.  Addresses below RAM8 are not visible to the
 *   controller and are returned unchanged.
 *
 *   The window base has to be read back here rather than assumed: the
 *   controller moves it while it boots, and pointers built from the value
 *   this port writes are rejected, which leaves the controller spinning
 *   on its mailbox.
 *
 ****************************************************************************/

static uint32_t cmac_m33_to_cmac_addr(uint32_t addr)
{
  uint32_t base = getreg32(DA1470X_MEMCTRL_CMI_DATA_BASE);

  if (addr > 0x2014ffff)
    {
      return addr + (0xff000000 - base + 0xeb0000);
    }
  else if (addr > 0x2012ffff)
    {
      return addr + (0xff000000 - base + 0xf00000);
    }
  else if (addr > 0x2010ffff)
    {
      return addr + 0xffff0000;
    }

  return addr;
}

/****************************************************************************
 * Name: cmac_lpclk_code
 ****************************************************************************/

static uint8_t cmac_lpclk_code(void)
{
  switch (da1470x_get_lpclk())
    {
      case 32768:
        return 0;

      case 32000:
      default:

        /* RCLP is not a supported controller clock; report 32 kHz and
         * keep the controller awake (sleep_enable stays false).
         */

        return 1;
    }
}

/****************************************************************************
 * Name: cmac_fill_tables
 *
 * Description:
 *   What the SDK's cmac_config_table_setup() does, reduced to the fields
 *   a NuttX host cares about.
 *
 ****************************************************************************/

static void cmac_fill_tables(const uint8_t bdaddr[6])
{
  uint8_t  *cfg = (uint8_t *)CMAC_CONFIG_TABLE;
  uint8_t  *dyn = (uint8_t *)CMAC_DYNAMIC_TABLE;
  uint32_t *tcs = (uint32_t *)CMAC_TCS_TABLE;
  const uint16_t *attr;
  const uint32_t *data;
  size_t nattr;
  size_t ndata;

  memcpy(cfg + CFG_BD_ADDRESS, bdaddr, 6);
  cfg[CFG_LP_CLOCK_FREQ]        = cmac_lpclk_code();
  cfg[CFG_LENGTH_EXCHANGE]      = 1;
  cfg[CFG_SYSTEM_TCS_LENGTH]    = 0;
  cfg[CFG_SYNTH_TCS_LENGTH]     = 0;
  cfg[CFG_RFCU_TCS_LENGTH]      = 0;
  *(uint16_t *)(cfg + CFG_LP_CLOCK_DRIFT)   = 500;
  *(uint16_t *)(cfg + CFG_RX_BUFFER_SIZE)   = 262;
  *(uint16_t *)(cfg + CFG_TX_BUFFER_SIZE)   = 262;

  /* Hand the controller the factory trim values.  It looks its own
   * groups up in the attribute array, which is indexed by group
   * identifier, and reads them out of the value array.  Both arrays are
   * copied into the memory the controller can reach; the pointers are
   * translated to its address view once it is running.
   *
   * These values are what puts the transmitter and the receiver of this
   * particular die on target.  Without them the radio works but is tens
   * of decibels down.
   */

  attr = da1470x_tcs_attributes(&nattr);
  data = da1470x_tcs_data(&ndata);

  if (ndata > CMAC_HOST_TCS_DATA_MAX)
    {
      wlerr("ERROR: %zu trim words do not fit, truncated\n", ndata);
      ndata = CMAC_HOST_TCS_DATA_MAX;
    }

  memcpy((void *)CMAC_HOST_TCS_ATTR, attr, nattr * sizeof(uint16_t));
  memcpy((void *)CMAC_HOST_TCS_DATA, data, ndata * sizeof(uint32_t));
  putreg32(0, CMAC_HOST_TEMPSENS);

  tcs[TCS_ATTR_PTR / 4]  = CMAC_HOST_TCS_ATTR;
  tcs[TCS_ATTR_SIZE / 4] = nattr;
  tcs[TCS_DATA_PTR / 4]  = CMAC_HOST_TCS_DATA;
  tcs[TCS_DATA_SIZE / 4] = ndata;

  wlinfo("Trim tables: %zu groups, %zu values\n", nattr, ndata);

  dyn[DYN_SLEEP_ENABLE] = 0;
  *(uint32_t *)(dyn + DYN_POWER_CTRL_WAKEUP) =
    getreg32(DA1470X_CRG_TOP_POWER_CTRL);
  *(uint32_t *)(dyn + DYN_POWER_CTRL_SLEEP) =
    getreg32(DA1470X_CRG_TOP_POWER_CTRL);
  *(uint32_t *)(dyn + DYN_POWER_LVL_WAKEUP) =
    getreg32(DA1470X_CRG_TOP_POWER_LVL);
  *(uint32_t *)(dyn + DYN_POWER_LVL_SLEEP) =
    getreg32(DA1470X_CRG_TOP_POWER_LVL);
  *(uint32_t *)(dyn + DYN_TEMPSENS_PTR) = CMAC_HOST_TEMPSENS;
}

/****************************************************************************
 * Name: cmac_mbox_free
 *
 * Description:
 *   Free bytes in the host->controller ring and the contiguous run
 *   available at the write index.
 *
 ****************************************************************************/

