AlmAck/nuttx/arch/arm/src/da1470x/da1470x_cmac.c
static size_t cmac_mbox_free(struct cmac_mbox_s *m, size_t *contiguous)
{
  uint16_t wr = m->wr;
  uint16_t rd = m->rd;

  if (rd > wr)
    {
      *contiguous = rd - wr - 1;
      return *contiguous;
    }
  else if (rd == 0)
    {
      *contiguous = CMAC_MBOX_BUFSIZE - wr - 1;
      return *contiguous;
    }
  else
    {
      *contiguous = CMAC_MBOX_BUFSIZE - wr;
      return CMAC_MBOX_BUFSIZE - wr + rd - 1;
    }
}

/****************************************************************************
 * Name: cmac_mbox_push
 *
 * Description:
 *   Copy up to len bytes into the host->controller ring.  Returns the
 *   number copied.  Must be called with interrupts disabled.
 *
 ****************************************************************************/

static size_t cmac_mbox_push(struct da1470x_cmac_s *priv,
                             const uint8_t *data, size_t len)
{
  struct cmac_mbox_s *m = priv->tx;
  size_t contiguous;
  size_t avail;
  size_t n;
  uint16_t wr;

  if ((m->flags & CMAC_MBOX_FLAG_RESET) != 0)
    {
      /* The controller has not consumed our reset yet */

      return 0;
    }

  avail = cmac_mbox_free(m, &contiguous);
  if (len > avail)
    {
      len = avail;
    }

  wr = m->wr;
  n  = len < contiguous ? len : contiguous;
  memcpy((void *)&m->buf[wr], data, n);
  wr += n;
  if (wr >= CMAC_MBOX_BUFSIZE)
    {
      wr = 0;
    }

  if (len > n)
    {
      memcpy((void *)&m->buf[0], data + n, len - n);
      wr = len - n;
    }

  m->wr = wr;
  return len;
}

/****************************************************************************
 * Name: cmac_tx_continue
 *
 * Description:
 *   Push pending write bytes; maintain the WRITE_PEND flag.
 *
 ****************************************************************************/

static void cmac_tx_continue(struct da1470x_cmac_s *priv)
{
  if (priv->pend_len > 0)
    {
      size_t n = cmac_mbox_push(priv, priv->pend_buf, priv->pend_len);

      priv->pend_buf += n;
      priv->pend_len -= n;

      if (priv->pend_len > 0)
        {
          priv->tx->flags |= CMAC_MBOX_FLAG_WRITE_PEND;
        }
      else
        {
          priv->tx->flags &= ~CMAC_MBOX_FLAG_WRITE_PEND;
        }

      cmac_signal();
    }
}

/****************************************************************************
 * Name: cmac_rx_drain
 *
 * Description:
 *   Deliver whatever the controller has written to the host ring.
 *
 ****************************************************************************/

static void cmac_rx_drain(struct da1470x_cmac_s *priv)
{
  struct cmac_mbox_s *m = priv->rx;
  uint8_t chunk[64];
  uint16_t rd;
  uint16_t wr;
  size_t n;

  if ((m->flags & CMAC_MBOX_FLAG_RESET) != 0)
    {
      /* Controller restarted its ring: discard and resynchronise */

      m->rd = m->wr;
      priv->last_rd = m->wr;
      m->flags &= ~CMAC_MBOX_FLAG_RESET;
    }

  if (m->magic != CMAC_MBOX_MAGIC || priv->last_rd != m->rd)
    {
      m->rd = m->wr;
      priv->last_rd = m->wr;
    }

  rd = m->rd;
  wr = m->wr;

  while (rd != wr)
    {
      n = 0;
      while (rd != wr && n < sizeof(chunk))
        {
          chunk[n++] = m->buf[rd];
          if (++rd >= CMAC_MBOX_BUFSIZE)
            {
              rd = 0;
            }
        }

      m->rd = rd;
      priv->last_rd = rd;

      if (priv->rx_cb != NULL)
        {
          priv->rx_cb(priv->rx_arg, chunk, n);
        }
    }

  /* The controller has data waiting for room on its side */

  if ((m->flags & CMAC_MBOX_FLAG_WRITE_PEND) != 0)
    {
      cmac_signal();
    }
}

/****************************************************************************
 * Name: cmac_interrupt
 ****************************************************************************/

static int cmac_interrupt(int irq, void *context, void *arg)
{
  struct da1470x_cmac_s *priv = (struct da1470x_cmac_s *)arg;
  uint32_t status = getreg32(CMAC_STATUS_REG);

  if ((status & CMAC_STATUS_ERROR_MASK) != 0)
    {
      wlerr("CMAC fault, status %08" PRIx32 "\n", status);
    }

  /* Acknowledge */

  modifyreg32(DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL, 0,
              CRG_XTAL_SYS_IRQ_CTRL_CMAC2SYS_IRQ_BIT);

  cmac_rx_drain(priv);
  cmac_tx_continue(priv);
  return OK;
}

/****************************************************************************
 * Name: cmac_mbox_init
 *
 * Description:
 *   Reset the host ring, wait for the controller to publish its magic and
 *   enable the interrupt.
 *
 ****************************************************************************/

static int cmac_mbox_init(struct da1470x_cmac_s *priv)
{
  struct cmac_mbox_s *tx = priv->tx;
  int i;

  memset((void *)tx->buf, 0, CMAC_MBOX_BUFSIZE);
  tx->flags = CMAC_MBOX_FLAG_RESET;
  tx->wr    = 0;
  tx->rd    = 0;
  priv->last_rd = priv->rx->rd;
  tx->magic = CMAC_MBOX_MAGIC;

  for (i = 0; i < CMAC_WAIT_LOOPS; i++)
    {
      if (priv->rx->magic == CMAC_MBOX_MAGIC)
        {
          break;
        }
    }

  if (i == CMAC_WAIT_LOOPS)
    {
      wlerr("Controller did not open its mailbox\n");
      return -ETIMEDOUT;
    }

  cmac_rx_drain(priv);

  irq_attach(DA1470X_IRQ_CMAC2SYS, cmac_interrupt, priv);
  up_enable_irq(DA1470X_IRQ_CMAC2SYS);
  cmac_signal();
  return OK;
}

/****************************************************************************
 * Name: cmac_boot
 *
 * Description:
 *   The controller boot handshake as performed by the SDK's
 *   cmac_cpu_start().
 *
 ****************************************************************************/

static int cmac_boot(struct da1470x_cmac_s *priv, const uint8_t bdaddr[6])
{
  const uint8_t *fw = g_da1470x_cmac_fw;
  size_t fwlen = g_da1470x_cmac_fw_end - g_da1470x_cmac_fw;
  uint32_t imgsize;
  uint32_t *tcs;
  uint32_t status;
  uint8_t *cfg;
  int ret;
  int i;

  if (fwlen < CMAC_FW_HDR_SIZE ||
      *(const uint32_t *)(fw + CMAC_FW_HDR_MAGIC_OFF) != CMAC_FW_HDR_MAGIC)
    {
      wlerr("Bad CMAC firmware header\n");
      return -EINVAL;
    }

  imgsize = *(const uint32_t *)(fw + CMAC_FW_HDR_IMGSIZE_OFF);
  if (imgsize + CMAC_FW_HDR_SIZE > fwlen || imgsize > CMAC_AREA_SIZE)
    {
      wlerr("CMAC firmware size mismatch\n");
      return -EINVAL;
    }

  /* Wake-up entry that powers PD_RAD for the controller.  The firmware
   * scans the LUT for exactly this trigger (MAC timer, master CMAC) at
   * boot and reuses it for the SYS2CMAC mailbox interrupt.
   */

  priv->pdc_entry = da1470x_pdc_add(DA1470X_PDC_TRIG_PERIPHERAL,
                                    DA1470X_PDC_PERIPH_MAC_TIMER,
                                    DA1470X_PDC_MASTER_CMAC,
                                    DA1470X_PDC_FLAG_EN_XTAL);
  if (priv->pdc_entry < 0)
    {
      return priv->pdc_entry;
    }

