AlmAck/nuttx/arch/arm/src/da1470x/da1470x_cmac.c
  /* Hold the controller in reset and drop anything left over from a
   * previous run (a warm reset of the host does not reset the CMAC).
   */

  modifyreg32(DA1470X_CRG_TOP_CLK_RADIO, 0,
              CRG_TOP_CLK_RADIO_CMAC_SYNCH_RESET);
  modifyreg32(DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL, 0,
              CRG_XTAL_SYS_IRQ_CTRL_CMAC2SYS_IRQ_BIT);

  /* Power the radio domain through the PDC if it is down */

  if ((getreg32(DA1470X_CRG_TOP_SYS_STAT) &
       CRG_TOP_SYS_STAT_RAD_IS_UP) == 0)
    {
      da1470x_pdc_set_pending(priv->pdc_entry);
      da1470x_pdc_acknowledge(priv->pdc_entry);
      ret = cmac_wait_bits(DA1470X_CRG_TOP_SYS_STAT,
                           CRG_TOP_SYS_STAT_RAD_IS_UP, true);
      if (ret < 0)
        {
          wlerr("PD_RAD did not come up\n");
          return ret;
        }
    }

  /* Release every hardware semaphore */

  for (i = 0; i < 32; i += 2)
    {
      putreg32(3u << i, DA1470X_MEMCTRL_BUSY_RESET);
    }

  /* CMAC and RF clocks, XTAL32M must be running and feed the CMAC */

  modifyreg32(DA1470X_CRG_TOP_CLK_RADIO, 0,
              CRG_TOP_CLK_RADIO_CMAC_CLK_ENABLE |
              CRG_TOP_CLK_RADIO_RFCU_ENABLE);

  ret = da1470x_xtal32m_enable();
  if (ret < 0)
    {
      return ret;
    }

  modifyreg32(DA1470X_CRG_TOP_CLK_CMAC_SWITCH, 0,
              CRG_TOP_CLK_CMAC_SWITCH_CMAC_CLK_SEL);
  ret = cmac_wait_bits(DA1470X_CRG_TOP_CLK_CMAC_SWITCH,
                       CRG_TOP_CLK_CMAC_SWITCH_CMAC_RUNNING_ON_XTAL, true);
  if (ret < 0)
    {
      wlerr("CMAC clock did not switch to XTAL32M\n");
      return ret;
    }

  /* Memory windows, then the image */

  putreg32(CMAC_CODE_BASE, DA1470X_MEMCTRL_CMI_CODE_BASE);
  putreg32(CMAC_DATA_WINDOW_BASE, DA1470X_MEMCTRL_CMI_DATA_BASE);
  putreg32(0, DA1470X_MEMCTRL_CMI_SHARED_BASE);

  memcpy((void *)CMAC_CODE_BASE, fw + CMAC_FW_HDR_SIZE, imgsize);

  cfg = (uint8_t *)CMAC_CONFIG_TABLE;
  cfg[CFG_WAIT_ON_MAIN] = 1;

  /* Clear any stale interrupt, release the reset and wait for the
   * controller to raise CMAC2SYS from its boot code.
   */

  putreg32(1, NVIC_IRQ0_31_CLEAR);
  putreg32(1, NVIC_IRQ0_31_CLRPEND);

  modifyreg32(DA1470X_CRG_TOP_CLK_RADIO,
              CRG_TOP_CLK_RADIO_CMAC_SYNCH_RESET, 0);

  ret = cmac_wait_bits(DA1470X_CRG_XTAL_SYS_IRQ_CTRL,
                       CRG_XTAL_SYS_IRQ_CTRL_CMAC2SYS_IRQ_BIT, true);
  if (ret < 0)
    {
      wlerr("CMAC did not boot\n");
      return ret;
    }

  status = getreg32(CMAC_STATUS_REG);
  if ((status & CMAC_STATUS_ERROR_MASK) != 0)
    {
      wlerr("CMAC boot fault, status %08" PRIx32 "\n", status);
      return -EIO;
    }

  modifyreg32(DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL, 0,
              CRG_XTAL_SYS_IRQ_CTRL_CMAC2SYS_IRQ_BIT);

  /* The controller waits on main(): fill the tables, convert the
   * pointers it dereferences to its own address view, then release it.
   */

  cmac_fill_tables(bdaddr);

  tcs = (uint32_t *)CMAC_TCS_TABLE;
  tcs[TCS_ATTR_PTR / 4] = cmac_m33_to_cmac_addr(tcs[TCS_ATTR_PTR / 4]);
  tcs[TCS_DATA_PTR / 4] = cmac_m33_to_cmac_addr(tcs[TCS_DATA_PTR / 4]);
  *(uint32_t *)(CMAC_DYNAMIC_TABLE + DYN_TEMPSENS_PTR) =
    cmac_m33_to_cmac_addr(*(uint32_t *)(CMAC_DYNAMIC_TABLE +
                                        DYN_TEMPSENS_PTR));

  cfg[CFG_WAIT_ON_MAIN] = 0;
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_cmac_start
 ****************************************************************************/

int da1470x_cmac_start(const uint8_t bdaddr[6], da1470x_cmac_rx_t rx,
                       void *arg)
{
  struct da1470x_cmac_s *priv = &g_cmac;
  int ret;

  if (priv->running)
    {
      return OK;
    }

  priv->rx_cb    = rx;
  priv->rx_arg   = arg;
  priv->pend_len = 0;

  ret = cmac_boot(priv, bdaddr);
  if (ret >= 0)
    {
      ret = cmac_mbox_init(priv);
    }

  if (ret < 0)
    {
      /* Leave the controller in reset so it cannot interrupt us */

      modifyreg32(DA1470X_CRG_TOP_CLK_RADIO, 0,
                  CRG_TOP_CLK_RADIO_CMAC_SYNCH_RESET);
      modifyreg32(DA1470X_CRG_XTAL_RESET_SYS_IRQ_CTRL, 0,
                  CRG_XTAL_SYS_IRQ_CTRL_CMAC2SYS_IRQ_BIT);
      return ret;
    }

  priv->running = true;
  return OK;
}

/****************************************************************************
 * Name: da1470x_cmac_stop
 ****************************************************************************/

void da1470x_cmac_stop(void)
{
  struct da1470x_cmac_s *priv = &g_cmac;

  if (!priv->running)
    {
      return;
    }

  up_disable_irq(DA1470X_IRQ_CMAC2SYS);
  irq_detach(DA1470X_IRQ_CMAC2SYS);

  modifyreg32(DA1470X_CRG_TOP_CLK_RADIO, 0,
              CRG_TOP_CLK_RADIO_CMAC_SYNCH_RESET);
  modifyreg32(DA1470X_CRG_TOP_CLK_RADIO,
              CRG_TOP_CLK_RADIO_CMAC_CLK_ENABLE |
              CRG_TOP_CLK_RADIO_RFCU_ENABLE, 0);

  da1470x_pd_disable(DA1470X_PD_RAD);
  priv->running = false;
}

/****************************************************************************
 * Name: da1470x_cmac_write
 ****************************************************************************/

int da1470x_cmac_write(const uint8_t *data, size_t len)
{
  struct da1470x_cmac_s *priv = &g_cmac;
  irqstate_t flags;
  size_t n;

  if (!priv->running)
    {
      return -ENODEV;
    }

  flags = enter_critical_section();

  if (priv->pend_len > 0)
    {
      leave_critical_section(flags);
      return -EAGAIN;
    }

  n = cmac_mbox_push(priv, data, len);
  if (n < len)
    {
      priv->pend_buf = data + n;
      priv->pend_len = len - n;
      priv->tx->flags |= CMAC_MBOX_FLAG_WRITE_PEND;
    }
  else
    {
      priv->tx->flags &= ~CMAC_MBOX_FLAG_WRITE_PEND;
    }

  cmac_signal();
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: da1470x_cmac_write_pending
 ****************************************************************************/

bool da1470x_cmac_write_pending(void)
{
  return g_cmac.pend_len > 0;
}

#endif /* CONFIG_DA1470X_BLE */
